export function Terms1() {
  return (
    <div className="terms-sty">
      <h3>- 코알라 기본 약관</h3>
      <p>
        수집하는 개인정보의 항목첫째, 회사는 회원가 입, 원활한 고객상담, 각종
        서비스의 제공을 위해 최초 회원가입 당시 아래와 같은 최소한의 개인정보를
        필수항목으로 수집하고 있습니다. 회원가입 - 이름, 생년월일, 성별, 아이디,
        비밀번호, 별명, 연락처(메일주소, 휴대폰 번호 중 선택), 가입인증정보
        만14세 미만 아동 회원가입 - 이름, 생년월일, 성별, 법정대리인 정보,
        아이디, 비밀번호, 연락처 (메일주소, 휴대폰 번호 중 선택), 가입인증정보
        단체아이디 회원가입 - 단체아이디, 회사명, 대표자명, 대표 전화번호, 대표
        이메일 주소, 단체주소, 관리자 아이디, 관리자 연락처, 관리자 부서/직위 -
        선택항목 : 대표 홈페이지, 대표 팩스번호
      </p>
      <p>
        둘째, 서비스 이용과정이나 사업처리 과정에서 아래와 같은 정보들이
        자동으로 생성되어 수집될 수 있습니다. - IP Address, 쿠키, 방문 일시,
        서비스 이용 기록, 불량 이용 기록
      </p>
      <p>
        셋째, 네이버 아이디를 이용한 부가 서비스 및 맞춤식 서비스 이용 또는
        이벤트 응모 과정에서 해당 서비스의 이용자에 한해서만 개인정보 추가
        수집이 발생할 수 있으며, 이러한 경우 별도의 동의를 받습니다.
      </p>
      <p>
        넷째, 성인컨텐츠, 유료/게임 등 일부 서비스 이용시 관련 법률 준수를 위해
        본인인증이 필요한 경우, 아래와 같은 정보들이 수집될 수 있습니다. - 이름,
        생년월일, 성별, 중복가입확인정보(DI), 암호화된 동일인 식별정보(CI),
        휴대폰 번호(선택), 아이핀 번호(아이핀 이용시), 내/외국인 정보
      </p>
      <p>
        다섯째, 유료 서비스 이용 과정에서 아래와 같은 결제 정보들이 수집될 수
        있습니다. - 신용카드 결제시 : 카드사명, 카드번호 등 - 휴대전화 결제시 :
        이동전화번호, 통신사, 결제승인번호 등 - 계좌이체시 : 은행명, 계좌번호 등
        - 상품권 이용시 : 상품권 번호 나. 개인정보 수집방법회사는 다음과 같은
        방법으로 개인정보를 수집합니다. - 홈페이지, 서면양식, 팩스, 전화, 상담
        게시판, 이메일, 이벤트 응모, 배송요청 - 협력회사로부터의 제공 - 생성정보
        수집 툴을 통한 수집
      </p>
    </div>
  );
}

export function Terms2() {
  return (
    <div className="terms-sty">
      <h3>개인정보 수집 약관</h3>
      <p>
        코알라의 수집하는 개인정보의 항목첫째, 회사는 회원가 입, 원활한
        고객상담, 각종 서비스의 제공을 위해 최초 회원가입 당시 아래와 같은
        최소한의 개인정보를 필수항목으로 수집하고 있습니다. 회원가입 - 이름,
        생년월일, 성별, 아이디, 비밀번호, 별명, 연락처(메일주소, 휴대폰 번호 중
        선택), 가입인증정보 만14세 미만 아동 회원가입 - 이름, 생년월일, 성별,
        법정대리인 정보, 아이디, 비밀번호, 연락처 (메일주소, 휴대폰 번호 중
        선택), 가입인증정보 단체아이디 회원가입 - 단체아이디, 회사명, 대표자명,
        대표 전화번호, 대표 이메일 주소, 단체주소, 관리자 아이디, 관리자 연락처,
        관리자 부서/직위 - 선택항목 : 대표 홈페이지, 대표 팩스번호
      </p>
      <p>
        둘째, 서비스 이용과정이나 사업처리 과정에서 아래와 같은 정보들이
        자동으로 생성되어 수집될 수 있습니다. - IP Address, 쿠키, 방문 일시,
        서비스 이용 기록, 불량 이용 기록
      </p>
      <p>
        셋째, 네이버 아이디를 이용한 부가 서비스 및 맞춤식 서비스 이용 또는
        이벤트 응모 과정에서 해당 서비스의 이용자에 한해서만 개인정보 추가
        수집이 발생할 수 있으며, 이러한 경우 별도의 동의를 받습니다.
      </p>
      <p>
        넷째, 성인컨텐츠, 유료/게임 등 일부 서비스 이용시 관련 법률 준수를 위해
        본인인증이 필요한 경우, 아래와 같은 정보들이 수집될 수 있습니다. - 이름,
        생년월일, 성별, 중복가입확인정보(DI), 암호화된 동일인 식별정보(CI),
        휴대폰 번호(선택), 아이핀 번호(아이핀 이용시), 내/외국인 정보
      </p>
      <p>
        다섯째, 유료 서비스 이용 과정에서 아래와 같은 결제 정보들이 수집될 수
        있습니다. - 신용카드 결제시 : 카드사명, 카드번호 등 - 휴대전화 결제시 :
        이동전화번호, 통신사, 결제승인번호 등 - 계좌이체시 : 은행명, 계좌번호 등
        - 상품권 이용시 : 상품권 번호 나. 개인정보 수집방법회사는 다음과 같은
        방법으로 개인정보를 수집합니다. - 홈페이지, 서면양식, 팩스, 전화, 상담
        게시판, 이메일, 이벤트 응모, 배송요청 - 협력회사로부터의 제공 - 생성정보
        수집 툴을 통한 수집
      </p>
    </div>
  );
}
export function Terms3() {
  return (
    <div className="terms-sty">
      <p>
        위치정보 이용약관에 동의하시면, 위치를 활용한 광고 정보 수신 등을
        포함하는 코알라 위치기반 서비스를 이용할 수 있습니다
      </p>
      <h3>제 1조 목적(목적)</h3>;
      <p>
        이 약관은 코알라 주식회사 (이하 “회사”)가 제공하는 위치정보사업 또는
        위치기반서비스사업과 관련하여 회사와 개인위치정보주체와의 권리, 의무 및
        책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.
      </p>
      <h3>제 2 조 (약관 외 준칙)</h3>
      <p>
        이 약관에 명시되지 않은 사항은 위치정보의 보호 및 이용 등에 관한 법률,
        정보통신망 이용촉진 및 정보보호 등에 관한 법률, 전기통신기본법,
        전기통신사업법 등 관계법령과 회사의 이용약관 및 개인정보처리방침, 회사가
        별도로 정한 지침 등에 의합니다.
      </p>
      <h3>제 3조 목적(서비스 내용 및 요금)</h3>;
      <p>
        ①회사는 직접 위치정보를 수집하거나 위치정보사업자인 이동통신사로부터
        위치정보를 전달받아 아래와 같은 위치기반서비스를 제공합니다. 1.Geo
        Tagging 서비스: 게시물에 포함된 개인위치정보주체 또는 이동성 있는 기기의
        위치정보가 게시물과 함께 저장됩니다.
      </p>
      <h3>제 4조 목적(개인위치정보주체의 권리)</h3>;
      <p>
        ①개인위치정보주체는 개인위치정보 수집 범위 및 이용약관의 내용 중 일부
        또는 개인위치정보의 이용ㆍ제공 목적, 제공받는 자의 범위 및
        위치기반서비스의 일부에 대하여 동의를 유보할 수 있습니다.
        ②개인위치정보주체는 개인위치정보의 수집ㆍ이용ㆍ제공에 대한 동의의 전부
        또는 일부를 철회할 수 있습니다.
      </p>
      <h3>제 5조 목적(법정대리인의 권리)</h3>;
      <p>
        ①회사는 만14세 미만 아동으로부터 개인위치정보를 수집ㆍ이용 또는
        제공하고자 하는 경우에는 만14세 미만 아동과 그 법정대리인의 동의를
        받아야 합니다.
      </p>
    </div>
  );
}
export function Terms4() {
  return (
    <div className="terms-sty">
      <h4>프로모션 정보 수집</h4>
      <p>
        프로모션으로 얻는 정보, 회사는 회원가 입, 원활한 고객상담, 각종 서비스의
        제공을 위해 최초 회원가입 당시 아래와 같은 최소한의 개인정보를
        필수항목으로 수집하고 있습니다. 회원가입 - 이름, 생년월일, 성별, 아이디,
        비밀번호, 별명, 연락처(메일주소, 휴대폰 번호 중 선택), 가입인증정보
        만14세 미만 아동 회원가입 - 이름, 생년월일, 성별, 법정대리인 정보,
        아이디, 비밀번호, 연락처 (메일주소, 휴대폰 번호 중 선택), 가입인증정보
        단체아이디 회원가입 - 단체아이디, 회사명, 대표자명, 대표 전화번호, 대표
        이메일 주소, 단체주소, 관리자 아이디, 관리자 연락처, 관리자 부서/직위 -
        선택항목 : 대표 홈페이지, 대표 팩스번호
      </p>
      <p>
        둘째, 서비스 이용과정이나 사업처리 과정에서 아래와 같은 정보들이
        자동으로 생성되어 수집될 수 있습니다. - IP Address, 쿠키, 방문 일시,
        서비스 이용 기록, 불량 이용 기록
      </p>
      <p>
        셋째, 네이버 아이디를 이용한 부가 서비스 및 맞춤식 서비스 이용 또는
        이벤트 응모 과정에서 해당 서비스의 이용자에 한해서만 개인정보 추가
        수집이 발생할 수 있으며, 이러한 경우 별도의 동의를 받습니다.
      </p>
      <p>
        넷째, 성인컨텐츠, 유료/게임 등 일부 서비스 이용시 관련 법률 준수를 위해
        본인인증이 필요한 경우, 아래와 같은 정보들이 수집될 수 있습니다. - 이름,
        생년월일, 성별, 중복가입확인정보(DI), 암호화된 동일인 식별정보(CI),
        휴대폰 번호(선택), 아이핀 번호(아이핀 이용시), 내/외국인 정보
      </p>
      <p>
        다섯째, 유료 서비스 이용 과정에서 아래와 같은 결제 정보들이 수집될 수
        있습니다. - 신용카드 결제시 : 카드사명, 카드번호 등 - 휴대전화 결제시 :
        이동전화번호, 통신사, 결제승인번호 등 - 계좌이체시 : 은행명, 계좌번호 등
        - 상품권 이용시 : 상품권 번호 나. 개인정보 수집방법회사는 다음과 같은
        방법으로 개인정보를 수집합니다. - 홈페이지, 서면양식, 팩스, 전화, 상담
        게시판, 이메일, 이벤트 응모, 배송요청 - 협력회사로부터의 제공 - 생성정보
        수집 툴을 통한 수집
      </p>
    </div>
  );
}
